Revit 2026 API

# DGNImportOptions(DGNImportOptions) Constructor

---

Constructs a new instance of DGNImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DGNImportOptions(
	DGNImportOptions option
)
```
```vb
Public Sub New (
	option As DGNImportOptions
)
```
```cpp
public:
DGNImportOptions(
	DGNImportOptions^ option
)
```
```fsharp
new :
        option : DGNImportOptions -> DGNImportOptions
```

#### Parameters

option DGNImportOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DGNImportOptions Class

DGNImportOptions Overload

Autodesk.Revit.DB Namespace